<!-- terraform-plan:dev -->
## terraform-plan (dev)

**Plan: 1 to add, 0 to change, 0 to destroy.**

<details>
<summary>Show full plan output</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_firestore_database.default will be created
  + resource "google_firestore_database" "default" {
      + app_engine_integration_mode         = (known after apply)
      + concurrency_mode                    = (known after apply)
      + create_time                         = (known after apply)
      + database_edition                    = (known after apply)
      + delete_protection_state             = "DELETE_PROTECTION_DISABLED"
      + deletion_policy                     = "ABANDON"
      + earliest_version_time               = (known after apply)
      + etag                                = (known after apply)
      + firestore_data_access_mode          = (known after apply)
      + id                                  = (known after apply)
      + key_prefix                          = (known after apply)
      + location_id                         = "eur3"
      + mongodb_compatible_data_access_mode = (known after apply)
      + name                                = "(default)"
      + point_in_time_recovery_enablement   = "POINT_IN_TIME_RECOVERY_DISABLED"
      + project                             = "dungeon-studio-genshin-dev"
      + realtime_updates_mode               = (known after apply)
      + type                                = "FIRESTORE_NATIVE"
      + uid                                 = (known after apply)
      + update_time                         = (known after apply)
      + version_retention_period            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```
</details>